Revit 2027 API
ConnectorManager.Lookup Method
 Lookup the connector using the unique index value that identify this connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Connector Lookup(
	int index
)
Public Function Lookup (
	index As Integer
) As Connector
public:
Connector^ Lookup(
	int index
)
member Lookup :
        index : int -> Connector
Parameters
index Int32
 The unique index value.
Return Value
Connector
 Returns the connector or null if a connector for the provided unique index value doesn't exist.
See Also
Reference
ConnectorManager Class
Autodesk.Revit.DB Namespace